alt/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// Box X: -6.1980 to 13.2342 (Total 19.4322m)
// Box Y: -4.9584 to 4.9584 (Total 9.9168m)
// Box Z: 0 to 9.9168 (Total 9.9168m)

vertices
(
    (-6.1980 -4.9584  0.0000) // 0
    (13.2342 -4.9584  0.0000) // 1
    (13.2342  4.9584  0.0000) // 2
    (-6.1980  4.9584  0.0000) // 3
    (-6.1980 -4.9584  9.9168) // 4
    (13.2342 -4.9584  9.9168) // 5
    (13.2342  4.9584  9.9168) // 6
    (-6.1980  4.9584  9.9168) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (210 120 110)
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    walls
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (3 2 6 7)
            (4 7 6 5)
            (0 1 2 3)
        );
    }
);

// ************************************************************************* //