alt/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}


gradSchemes
{
    default         Gauss linear;
}


divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss upwind;
    div(phi,h)      bounded Gauss upwind;
    div(phi,K)      bounded Gauss upwind; 

    div(phi,nuTilda) bounded Gauss upwind; 

    div(phid,p) Gauss upwind;
    div((phi|interpolate(rho)),p)  bounded Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

gradSchemes
{
    default Gauss linear;


    grad(U)         cellLimited Gauss linear 1;
    grad(h)         cellLimited Gauss linear 1;
    
 
    grad(nuTilda)   Gauss linear;
}
/*
laplacianSchemes
{
    default         Gauss linear limited 0.33;

    laplacian(muEff,U)           Gauss linear limited 0.33;
    laplacian(alphaEff,h)        Gauss linear limited 0.33;
    laplacian(DnuTildaEff,nuTilda) Gauss linear limited 0.33;
    laplacian((rho*DnuTildaEff),nuTilda)   Gauss linear limited 0.33;
    laplacian((1|A(U)),p)        Gauss linear limited 0.33; 
    laplacian((rho*nuEff),U)         Gauss linear limited 0.33;
    laplacian(rhorAUf,p)             Gauss linear limited 0.33;
}
*/
laplacianSchemes
{
    default         Gauss linear limited 0.33;

    laplacian(muEff,U)           Gauss linear limited 0.33;
    laplacian(alphaEff,h)        Gauss linear limited 0.33;
    laplacian(DnuTildaEff,nuTilda) Gauss linear limited 0.33;
    laplacian((rho*DnuTildaEff),nuTilda)   Gauss linear limited 0.33;
    laplacian((1|A(U)),p)        Gauss linear limited 0.33; 
    laplacian((rho*nuEff),U)         Gauss linear limited 0.33;
    laplacian(rhorAUf,p)             Gauss linear limited 0.33;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}
// ************************************************************************* //
