alt/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(U|h|nuTilda)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3; 

    residualControl
    {
        p               1e-6;
        U               1e-6;
        h               1e-6;
        nuTilda         1e-6;
    }

    rhoMin          0.001; // Prevents vacuum errors
    rhoMax          2.0;   
    limitTemperature on;   // Built-in protection
    minT            150;   // Minimum K
    maxT            1000;  // Maximum K
}

relaxationFactors
{
    fields
    {
        p               0.1; 
        rho             0.1; 
    }
    equations
    {
        U               0.3; 
        h               0.3; 
        nuTilda         0.5; 
    }
}

// ************************************************************************* //