alt/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    alt.stl
    {
        type triSurfaceMesh;
        name Alt;
    }
}

castellatedMeshControls
{
    maxLocalCells   1000000;
    maxGlobalCells  5000000;
    minRefinementCells 10;
    nCellsBetweenLevels 3; // Increased to smooth the transition between coarse and fine mesh
    resolveFeatureAngle 30;
    allowFreeStandingZoneFaces  true;

    refinementSurfaces
    {
        Alt
        {
            level (6 7); // Increased from (5 6) to fix surface jaggedness
            patchInfo { type wall; }
        }
    }

    features
    (
        { file "alt.eMesh"; level 7; } // Match the surface max level
    );

    refinementRegions
    {
        refinementBox
        {
            mode distance;
            levels ((0.05 6) (0.2 5) (0.5 4)); // Tighter, multi-stage wake refinement
        }
    }

    locationInMesh (0 0 0); 
}

snapControls
{
    nSmoothPatch         5;
    nSmoothInternal      15;
    nSolveIter           100; // Drastically increased to force surface alignment
    nRelaxIter           8;   // Increased to prevent mesh tangling during snapping
    nFeatureSnapIter     15;  // More iterations for the eMesh edges
    
    tolerance            2.0;
    implicitFeatureSnap  false;
    explicitFeatureSnap  true;
    multiRegionFeatureSnap false;
}

meshQualityControls
{
    maxNonOrtho         65; 
    maxBoundarySkewness 4;
    maxInternalSkewness 2;
    maxConcave          80;
    minDeterminant      0.001;
    minVol              1e-15; // Raised slightly to prevent "infinitesimal" cells
    
    nSmoothScale        20; // Increased to 20 to smooth out the high-skew regions
    errorReduction      0.75;
}

mergeTolerance 1e-6;
debug 0;

// ************************************************************************* //